.doom.d/config.org
#+TITLE: Config File
#+PROPERTY: header-args :tangle ~/.doom.d/config.el :results silent
#+bibliography: "~/FilenSync/org/bibliography.bib"
#+cite_export: basic

* Table of Contents :TOC_2:noexport:
- [[#shebang][shebang]]
- [[#user-full-name][user-full-name]]
- [[#mu4e][mu4e]]
  - [[#standard-config][standard config]]
  - [[#after-standard-config][after standard config]]
- [[#font][font]]
- [[#theme][theme]]
- [[#org-directory][org directory]]
- [[#recursive-agenda-files][recursive agenda files]]
- [[#no-line-numbers][no line numbers]]
- [[#horizontal-scroll-with-mouse-wheel][horizontal scroll with mouse wheel]]
- [[#begin-org-section][begin org section]]
  - [[#export-org-backend-enabling][export org backend enabling]]
  - [[#fixed-flush-left-indentation][fixed flush left indentation]]
  - [[#effort_all-org-global-properties][~Effort_ALL~: ~org-global-properties~]]
  - [[#org-column-view-format][~org-column~ view format]]
  - [[#logbook-and-clockbook][~LOGBOOK~ and ~CLOCKBOOK~]]
  - [[#org-agenda-default-settings][~org-agenda~ default settings]]
  - [[#org-agenda-custom-commands][~org-agenda-custom-commands~]]
  - [[#org-habit][~org-habit~]]
  - [[#todo-keywords][~TODO~ keywords]]
  - [[#org-log-done-insert-closed-when-done][~org-log-done~: insert ~CLOSED~ when ~DONE~]]
  - [[#org-latex-classes][~org-latex-classes~]]
  - [[#latex-export-table-of-contents-settings][latex export table of contents settings]]
  - [[#latex-other-languages][latex other languages]]
  - [[#org-babel-python-command][~org-babel-python-command~]]
  - [[#mu4e-store-links][mu4e store links]]
  - [[#how-many-todos-left-info-in-heading][how many todos left info in heading]]
  - [[#recursive-todo-cookie-statistics][recursive ~TODO~ cookie statistics]]
  - [[#use-org-id-to-store-links-when-appropriate][use ~org-id~ to store links when appropriate]]
  - [[#org-file-apps-open-links-with-default-application][~org-file-apps~: open links with default application]]
  - [[#org-clock][~org-clock~]]
  - [[#org-export-exclude-tags][~org-export-exclude-tags~]]
  - [[#disable-crypt-tag-inheritance][disable "crypt" tag inheritance]]
  - [[#org-transclusion][~org-transclusion~]]
  - [[#org-depend][~org-depend~]]
  - [[#org-roam][~org-roam~]]
  - [[#org-roam-bibtex][~org-roam-bibtex~]]
  - [[#org-capture][~org-capture~]]
  - [[#org-ref][~org-ref~]]
  - [[#org-glossary][~org-glossary~]]
  - [[#org-cite][~org-cite~]]
  - [[#underscore-and-hat-handling][underscore and hat handling]]
  - [[#org-tag-alist][~org-tag-alist~]]
  - [[#created-property][=CREATED= property]]
  - [[#org-priority-highestdefaultlowest][~org-priority-[highest|default|lowest]~]]
  - [[#myorg-archive-done-tasks][~my/org-archive-done-tasks~]]
  - [[#myorg-agenda-custom-search-next-action-and-myorg-convert-to-next-action][~my/org-agenda-custom-search-next-action~ and ~my/org-convert-to-next-action~]]
  - [[#load-tags-file][load tags file]]
  - [[#cnld-log][CNLD log]]
  - [[#cnld-org-fontify-quote-and-verse-blocks-disabled][CNLD org fontify quote and verse blocks [DISABLED]]]
  - [[#cnld-disable-heading-numbering-during-export][CNLD disable heading numbering during export]]
  - [[#cnld-prevent-invisible-edits-commented-out][CNLD prevent invisible edits [Commented out]]]
- [[#end-org-section][end org section]]
- [[#flyspell-mode-t][flyspell-mode t]]
- [[#ispell-config][ispell config]]
- [[#personal-keybindings][personal keybindings]]
- [[#start-week-on-monday][start week on monday]]
- [[#dailies][dailies]]
- [[#treemacs][treemacs]]
- [[#disable-backup][disable backup]]
- [[#custom-set-faces][custom set faces]]
- [[#custom-set-variables][custom set variables]]
- [[#60-char-ruler][60 char ruler]]
- [[#git-gutter][git gutter]]
- [[#org-ai][~org-ai~]]
- [[#fix-zo-not-working-in-macos][fix =zo= not working in macOS]]
- [[#orgmode-readonly-custom-functions][orgmode readonly custom functions]]
- [[#keyboard-shortcuts][keyboard shortcuts]]

* shebang
:PROPERTIES:
:header-args: :results silent :tangle ~/.doom.d/config.el
:ID:       741425b4-8f1d-44c0-9245-7fe9a5c62e12
:END:

#+begin_src elisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!


;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.

* user-full-name
:PROPERTIES:
:ID:       c1cc08a8-95ed-4bb6-a523-41fb398a2dd9
:END:
#+begin_src elisp
(setq user-full-name "Manuel Fuica Morales"
      ;; user-mail-address "m.fuica01@ufromail.cl"
      )
#+end_src

#+RESULTS:
: Manuel Fuica Morales

;; (setq smtpmail-smtp-server "smtp.gmail.com")
;; (setq smtpmail-smtp-service 587) ;; this might need to change


;; https://stackoverflow.com/questions/17281669/using-smtp-gmail-and-starttls
;; https://emacs.stackexchange.com/questions/46257/sending-email-fails-with-process-smtpmail-not-running

* mu4e
** standard config
:PROPERTIES:
:ID:       53c3636b-214b-43e4-967b-e8af4a806c45
:END:

#+begin_src elisp
(setq mu4e-maildir "~/Maildir")
(setq mu4e-attachment-dir (expand-file-name "~/myDrive/mailAttachments"))
#+end_src

;; Details for mu4e-attachement-dir configuration:
;; https://github.com/hlissner/doom-emacs/issues/3294

;; https://gist.github.com/areina/3879626

#+begin_src elisp
(setq message-send-mail-function 'smtpmail-send-it
      starttls-use-gnutls t
      smtpmail-starttls-credentials
      '(("smtp.gmail.com" 587 nil nil))
      smtpmail-auth-credentials
      (expand-file-name "~/.authinfo.gpg")
      smtpmail-default-smtp-server "smtp.gmail.com"
      smtpmail-smtp-server "smtp.gmail.com"
      smtpmail-smtp-service 587
      smtpmail-debug-info t
      ;; auth-sources '(password-store)
      auth-source-debug t
      )
#+end_src

** after standard config :crypt:
:PROPERTIES:
:ID:       1ee20f94-c54e-4597-9a06-d3b32ecd1b32
:END:

-----BEGIN PGP MESSAGE-----

jA0ECQMC3MG0U+DW6sD/0ukBLNhXmPMl96VRjoOoDHZVLB1Tg7ox5eUbt2GLVVsx
cBhR56uJe0NsNVvGS8gZh/kG9N21jNVJHf8fNIsQM4Vf48RqK6o8XbWwLPh47+k7
tLu7iRPjZnp985qpxF0KVMIVrOUIVPtWT8wxHSLLPh5/0tE5o1E7qeteKF2VMDgW
OvWJLLY/ANeAx/Q6ECJJ+HmwZQrJiIzxqrsYf6hJ8W+Sqzo2xgafsF7qXVG7QoEV
QZ0s2+D9lRd8/7tmaBUpusfHcp5KbAAaRnFwAqpv04/RRDjcAAHXmL5ZS/VUk4Hw
i24m28RLVpiMq73ibBs0A9vXlmr1emOppbLTG+MMRpIgwK6akn9hWhX42s+swMfu
dpXEwEDXsaua41XZe7+SOa0SxaEL7eQfdawq/iX4Ej5i6vO7CD/lWFZ/R6EjiYCQ
XShHdMxgiwp1meGu/JlTbPNfjY9H/pxbLbnFWjmoTrzGrcJ6HP2bAl9dwbejRPow
vBfoPGFUW+Ma5MTvUE7ZBd79fxFqFw2s2hK+gV/3/pijuXqdlvfAfr8cD/AwwWkU
9//kQjv8v++AyC9lO6w9iaMmp38vWu5NDrcnXfhAX9dRDdxhXHBWgdf7bwqtn8D8
t9yibjiPj6BVogXmXPESp5ux2Zt1+p2v7KL1ymeCDWLl82QVDpn3pWEndKUoutQn
rhL7T1r4kXZ6NC4iFR56ROMPLzA=
=2AAL
-----END PGP MESSAGE-----

* font
:PROPERTIES:
:ID:       3d09ad0f-b02f-419e-a6a4-5a137258ef5f
:END:

Doom exposes five (optional) variables for controlling fonts in Doom. Here
are the three important ones:

+ `doom-font'
+ `doom-variable-pitch-font'
+ `doom-big-font' -- used for `doom-big-font-mode'; use this for
  presentations or streaming.

They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
font string. You generally only need these two:
(setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
doom-variable-pitch-font (font-spec :family "sans" :size 13))

* theme
:PROPERTIES:
:ID:       1f7b461e-9dcb-4f4b-b9b4-d3fbf8857903
:END:
There are two ways to load a theme. Both assume the theme is installed and
available. You can either set `doom-theme' or manually load a theme with the
`load-theme' function. This is the default:

#+begin_src elisp
(setq doom-theme 'doom-gruvbox)
#+end_src
- Check the different themes
  + https://github.com/hlissner/emacs-doom-themes/tree/screenshots

* org directory
:PROPERTIES:
:ID:       86d962a4-8100-483a-a739-59cfcdfb0655
:END:

If you use `org' and don't want your org files in
the default location below, change `org-directory'.
It must be set before org loads!

#+begin_src elisp
(setq org-directory "~/FilenSync/org/")
#+end_src

;; Added by me
;; https://stackoverflow.com/questions/11384516/how-to-make-all-org-files-under-a-folder-added-in-agenda-list-automatically

* recursive agenda files
:PROPERTIES:
:ID:       7e605bae-b5f5-41ad-b95e-c02f621b7926
:END:

(setq org-agenda-files (directory-files-recursively "~/org/" "\\.org$"))


#+begin_src elisp
(setq org-agenda-files "~/.doom.d/agenda-files.txt")
#+end_src

- https://orgmode.org/worg/org-tutorials/orgtutorial_dto.html
- https://orgmode.org/manual/Agenda-Files.html

(setq org-agenda-files (list "~/org/auxRoam/.org"
                             "~/org/school.org"
                             "~/org/home.org"))

* no line numbers
:PROPERTIES:
:ID:       23918f8e-2350-40a7-b4d8-57520c5a36cf
:END:
This determines the style of line numbers in effect. If set to `nil', line
numbers are disabled. For relative line numbers, set this to ='relative=.

# (setq display-line-numbers-type 'relative)
#+begin_src elisp
(setq display-line-numbers-type nil)
#+end_src

https://github.com/hlissner/doom-emacs/blob/develop/docs/faq.org#why-is-emacsdoom-slow

Here are some additional functions/macros that could help you configure Doom:

- `load!' for loading external *.el files relative to this one
- `use-package' for configuring packages
- `after!' for running code after a package has loaded
- `add-load-path!' for adding directories to the `load-path', relative to
  this file. Emacs searches the `load-path' when you load packages with
  `require' or `use-package'.
- `map!' for binding new keys

To get information about any of these functions/macros, move the cursor over
the highlighted symbol at press 'K' (non-evil users must press 'C-c g k').
This will open documentation for it, including demos of how they are used.

You can also try 'gd' (or 'C-c g d') to jump to their definition and see how
they are implemented.

* horizontal scroll with mouse wheel
# - [2023-08-30 Wed 13:05]

#+begin_src elisp
(setq mouse-wheel-tilt-scroll t)
#+end_src

* begin org section
:PROPERTIES:
:ID:       72258b79-1e04-4a73-95b8-515f48143e5d
:END:
#+begin_src elisp
;; BEGIN AFTER ORG
(after! org
#+end_src

** export org backend enabling
:PROPERTIES:
:ID:       a794b757-4dcb-4a6b-a515-89e4419b5f19
:END:
#+begin_src elisp
(add-to-list 'org-export-backends 'org)
#+end_src

** fixed flush left indentation
:PROPERTIES:
:ID:       27de66e8-d440-4a80-bab7-843bebf87b8b
:END:
#+begin_src elisp
(setq org-adapt-indentation nil)
#+end_src

More consistent; if I change heading level I don't have
to fix line breaks due to later changes in heading
level. CLI 80 chars FTW.

*** other settings
:PROPERTIES:
:ID:       a4d196f2-9fc3-44ab-97a5-fb2130c5d167
:END:
#+begin_src elisp
(setq org-fontify-quote-and-verse-blocks nil
      org-fontify-whole-heading-line nil
      org-hide-leading-stars nil
      org-startup-indented nil
      )
#+end_src

- https://emacs.stackexchange.com/questions/9709/keep-the-headlines-expanded-in-org-mode

*** start folded nil
:PROPERTIES:
:ID:       964fd048-37ad-4bff-a09e-dbf48ab72124
:END:
It's gotta be faster. Useful too when you have a TOC heading first.

#+begin_src elisp
(setq org-startup-folded nil)
#+end_src

** ~Effort_ALL~: ~org-global-properties~
:PROPERTIES:
:ID:       64ea25a8-c5a6-4d48-a199-3d5162305169
:END:
#+begin_src elisp
;; https://github.com/pokeefe/Settings/blob/master/emacs-settings/.emacs.d/modules/init-org.el
;; Effort and global properties
(setq org-global-properties '(
                              ("Effort_ALL" .
                               "0 0:01 0:03 0:05 0:10 0:15 0:20 0:30 0:45 1:00 1:30 2:00 2:30 3:00 3:30 4:00 4:30 5:00 5:30 6:00 6:30 7:00 7:30 8:00")
                              )
      )
#+end_src

** ~org-column~ view format
:PROPERTIES:
:ID:       82451b12-f96d-40b5-9b2a-2908eee6eff4
:END:

Set global Column View format.

#+begin_src elisp
(setq org-columns-default-format '"%60ITEM(Item) %5Effort(Estim){:} %5CLOCKSUM(Curr)")
#+end_src

(setq org-columns-default-format '"%34ITEM(Item) %10TAGS(Tags) %5TODO(State)
 %5Effort(Estim){:} %10CLOCKSUM(Actual)")

** ~LOGBOOK~ and ~CLOCKBOOK~
:PROPERTIES:
:ID:       a065fc59-7ecf-4c1a-aa3c-d01f7f36eb28
:END:
- https://stackoverflow.com/questions/24686129/how-can-i-make-org-mode-store-state-changes-for-a-repeating-task-in-a-drawer

#+begin_src elisp
(setq org-log-into-drawer "LOGBOOK")
(setq org-clock-into-drawer "CLOCKBOOK")
#+end_src

** ~org-agenda~ default settings

#+begin_src elisp
(setq org-agenda-span 3)
(setq org-agenda-start-day "-0d") ; start on current day,
                                        ; useful when exporting html 28-day version.
(setq org-agenda-start-on-weekday nil)
#+end_src
- [[https://emacs.stackexchange.com/questions/12517/how-do-i-make-the-timespan-shown-by-org-agenda-start-yesterday][org mode - How do I make the timespan shown by org agenda start yesterday? - Emacs Stack Exchange]]

Hide filename in agenda view
#+begin_src elisp
(setq org-agenda-prefix-format "%t %s")
#+end_src
- https://lists.gnu.org/archive/html/emacs-orgmode/2010-01/msg00744.html


Disable "now" line in org agenda view.
That line is counterintuitive sometimes
when checking agenda remotely.

#+begin_src elisp
(setq org-agenda-show-current-time-in-grid nil)
(setq org-agenda-hide-tags-regexp ".")
(setq org-agenda-use-time-grid nil)
#+end_src
- https://orgmode.org/manual/Agenda-Commands.html

