.doom.d/config.org
** ~org-agenda-custom-commands~
:PROPERTIES:
:ID:       e4bd5984-7063-44f3-973d-51c298645761
:END:


#+begin_src elisp
(setq org-agenda-custom-commands
      '(
        ;; ( "1" "Next 28 days."
        ;;   ((agenda ""))
        ;;   ;; ((org-agenda-tag-filter-preset '("-habit")))
          ;; ("~/agenda-today.html") ;; enables html export of this agenda view
        ;;   ((org-agenda-span 28))
        ;;   ((org-agenda-start-day "-0d"))
        ;;   )
        ("1" "Next 28 days" agenda ""
         ((org-agenda-span 28)
          (org-agenda-start-day "-0d")
          (org-agenda-remove-tags t)
         )
         ("~/test.pdf"))
        ;; ( "2" "Last and next 3 days."
        ;;   ;; Made to be exported to html
        ;;   ((agenda ""))
        ;;            ((org-agenda-span 7))
        ;;            ((org-agenda-start-day "-2"))
        ;;   )
        ;; ( "8" "Next 8 days, don't show today."
        ;;   ;; Made to be exported to html
        ;;   ((agenda ""))
        ;;            ((org-agenda-span 8))
        ;;            ((org-agenda-start-day "+1d"))
        ;;   )
        ;; ( "4" "Next 14 days, don't show today."
        ;;   ;; Made to be exported to html
        ;;   ((agenda ""))
        ;;            ((org-agenda-span 14))
        ;;            ((org-agenda-start-day "+1d"))
        ;;   )
        ;; ( "0" "Next 28 days, don't show today."
        ;;   ;; Made to be exported to html
        ;;   ((agenda ""))
        ;;            ((org-agenda-span 28))
        ;;            ((org-agenda-start-day "+1d"))
        ;;   )
        ( "H" "Only 'habit' tag"
          ((agenda ""))
          ((org-agenda-tag-filter-preset '("+habit"))))
        ( "h" "Exclude 'habit' tag"
          ((agenda ""))
          ((org-agenda-tag-filter-preset '("-habit"))))
        ;; ( "n" "Only 'today' tag."
        ;;   ((agenda ""))
        ;;   ((org-agenda-tag-filter-preset '("+today"))))
        ( "O" "Only 'oneoff' tag."
          ((agenda ""))
          ((org-agenda-tag-filter-preset '("+oneoff"))))
        ( "R" "Only 'recurring' tag."
          ((agenda ""))
          ((org-agenda-tag-filter-preset '("+recurring"))))
        ( "u" "Exclude 'university' tag."
          ((agenda ""))
          ((org-agenda-tag-filter-preset '("-university"))))
        ( "U" "Only 'university' tag."
          ((agenda ""))
          ((org-agenda-tag-filter-preset '("+university"))))
        ( "l" "All 'university' except 'lecture' and 'assistantship'."
          ((agenda ""))
          ((org-agenda-tag-filter-preset '("+university" "-lecture" "-assistantship"))))
        ( "L" "Only lectures and assistantships."
          ((agenda ""))
          ((org-agenda-tag-filter-preset '("+lecture" "+assistantship"))))
        ( "c" "Only 'contacts' tag."
          ((agenda ""))
          ((org-agenda-tag-filter-preset '("+contacts"))))
        ( "b" "Only 'birthday' tag."
          ((agenda ""))
          ((org-agenda-tag-filter-preset '("+birthday"))))
        ( "k" "Exclude 'music' tag."
          ((agenda ""))
          ((org-agenda-tag-filter-preset '("-music"))))
        ( "K" "Only 'music' tag."
          ((agenda ""))
          ((org-agenda-tag-filter-preset '("+music"))))
        )
      )
#+end_src

- https://emacs.stackexchange.com/questions/38183/how-to-exclude-a-file-from-agenda

** ~org-habit~
:PROPERTIES:
:ID:       c6e2c52f-51bd-4fd9-8fd5-080fb2a617be
:END:
#+begin_src elisp
(add-to-list 'org-modules 'org-habit)
#+end_src
- https://github.com/hlissner/doom-emacs/issues/3102


#+begin_src elisp
(setq org-habit-preceding-days 21)
(setq org-habit-following-days 7)
#+end_src

- https://orgmode.org/manual/Tracking-your-habits.html

** ~TODO~ keywords
:PROPERTIES:
:ID:       55c05291-82b3-443f-93ee-68a68b38d3de
:END:

#+begin_src elisp
(setq org-todo-keywords
      '((sequence
         "WAIT(w@)"
         "NEXT(n!)"
         ;; "DOIN(d!)"
         "TODO(t!)"
         "PROJ(p!)"
         "INCU(i!)"
         "|"
         "DONE(D@)"
         "CNLD(C@)" )
        )
      )
#+end_src

- TRACK TODO STATE CHANGES
- https://orgmode.org/manual/Tracking-TODO-state-changes.html
- OrgMode E03S01: Automatic logging of status changes:
  + https://www.youtube.com/watch?v=R4QSTDco_w8

** ~org-log-done~: insert ~CLOSED~ when ~DONE~
:PROPERTIES:
:CREATED:  [2024-09-30 Mon 00:21]
:END:

#+begin_src elisp
(setq org-log-done 'note)
#+end_src

** ~org-latex-classes~

- [[https://ctan.org/tex-archive/macros/latex/contrib/extsizes][CTAN: /tex-archive/macros/latex/contrib/extsizes]]
- [[https://emacs.stackexchange.com/questions/29726/org-mode-different-latex-document-class][org export - org-mode different latex document class - Emacs Stack Exchange]]
- [[https://github.com/djnavarro/rbook/issues/41][Any clue how to source it with 12pt font size? · Issue #41 · djnavarro/rbook · GitHub]]
- [[https://superuser.com/questions/896741/how-do-i-configure-org-latex-classes-in-emacs][How do I Configure 'org-latex-classes in .emacs? - Super User]]
- [[https://lists.gnu.org/archive/html/emacs-orgmode/2012-10/msg00435.html][Re: [O] #+LATEX_CLASS: IEEEtran]]


: \documentclass[letter,twoside,14pt,openright]{extbook}

(require 'ox-latex)
#+begin_src elisp
(with-eval-after-load 'ox-latex
(add-to-list 'org-latex-classes
             '("extbook"
               "\\documentclass{extbook}"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
(add-to-list 'org-latex-classes
             '("extarticle"
               "\\documentclass{extarticle}"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
(add-to-list 'org-latex-classes
             '("extreport"
               "\\documentclass{extreport}"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
(add-to-list 'org-latex-classes
             '("IEEEtran"
               "\\documentclass{IEEEtran}"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
)
#+end_src

** latex export table of contents settings
:PROPERTIES:
:ID:       994f0f4d-3184-445a-b079-2a1c894dbcaf
:END:
Orgmode latex export: new page after TOC
- https://emacs.stackexchange.com/questions/42558/org-mode-export-force-page-break-after-toc

# #+begin_src elisp
# (setq org-latex-toc-command "\\tableofcontents \\clearpage")
# #+end_src

** latex utf8x instead of utf8 :noexport:
:PROPERTIES:
:ID:       748118f7-db21-46af-b1c1-628faa6f3a49
:END:
# noexport tag since it does not solve the original problem:
# [[id:9448d2f9-a00f-458b-b608-bca78e151138][how to print small greek epsilon in pdf orgmode export? (ε)]]

- https://emacs.stackexchange.com/questions/20062/exporting-unicode-characters-to-pdf-using-latex-from-org-mode


Seems like the default is =utf8=, and that is a problem when you want to
write something weird like _/ε/_ for authors/ in =pdf= export;
the =html= export has not presented this problem so far.

# #+begin_src elisp
# (setq org-latex-inputenc-alist '(("utf8" . "utf8x")))
# #+end_src

** latex other languages
:PROPERTIES:
:CREATED:  [2021-10-28 Thu 00:11]
:END:
- =HTML= exports works fine, but when exporting to
  =PDF=, =#+LANGUAGE: <yourLang>= is not enough.


This seems to do the job.

#+begin_center
This one does not work.
#+end_center

: #+begin_example elisp
: (add-to-list 'org-latex-packages-alist '("AUTO" "babel" t ("pdflatex")))
: #+end_example
- https://www.reddit.com/r/orgmode/comments/f5unzb/export_setting_language_does_not_work/


An alternative not tested solution is to put this in your file.

#+begin_center
This one works!
#+end_center

: #+LANGUAGE: es
: #+LATEX_HEADER: \usepackage[spanish]{babel}

Almost the same except for the extra =#+LATEX_HEADER= part.


See also:
- https://emacs.stackexchange.com/questions/21239/change-table-of-contents-title-in-org-mode-according-to-document-language

** ~org-babel-python-command~
:PROPERTIES:
:CREATED:   [2024-03-28 Thu 11:26]
:END:

- https://emacs.stackexchange.com/questions/57447/org-babel-loads-different-python


#+begin_src elisp
(setq org-babel-python-command "~/venv/python3.12.2/bin/python")
#+end_src

** mu4e store links
But when enabling this, it overrides the other org-store-link* protocols.
Have to enable, compile and restart emacs when wanting to use, and disable
compile and restart emacs when wanting to store links from anywhere else.

At least the links are still useful when the mechanism is disabled, but have
to do something about it.
##+begin_src elisp

;; [2021-05-03 Mon]
;; By default, doom emacs wont store email links in mu4e headers view
;; have to enable org-mu4e
;; (require 'org-mu4e) ; interferes with the rest of org-links

;; MORE ABOUT ORG MODE
;; https://orgmode.org/manual/Breaking-Down-Tasks.html#Breaking-Down-Tasks
##+end_src

** how many todos left info in heading
:PROPERTIES:
:ID:       485fa339-fde6-47bb-9873-59bf7e3d5ded
:END:

Disabled because causes issues. Not investigated.

#+begin_example elisp
(add-hook 'org-after-todo-statistics-hook 'org-summary-todo)
#+end_example

also, you have to set the cookie property to 'todo
recursive'; you can use Doom's 'SPC m o'. Still, it's
too much work. Have to do something about it.

** recursive ~TODO~ cookie statistics
:PROPERTIES:
:CREATED:  [2023-05-18 Thu 11:20]
:END:
- [cite:@org_recursive_todo_statistics]

#+begin_src elisp
(setq org-hierarchical-todo-statistics nil)
#+end_src

: (setq org-hierarchical-todo-statistics 'recursive)
: (setq org-hierarchical-todo-statistics '(recursive))
: (setq org-hierarchical-todo-statistics "recursive")
: (setq org-hierarchical-todo-statistics '("recursive"))

** use ~org-id~ to store links when appropriate
:PROPERTIES:
:ID:       7a291636-2179-4180-8d53-1614e7074454
:END:

#+begin_src elisp
(setq org-id-link-to-org-use-id t)
#+end_src

