.doom.d/config.org
** ~org-file-apps~: open links with default application
:PROPERTIES:
:ID:       c9e0a789-0d20-4dfa-b457-ff5a9ed27698
:END:

#+begin_src elisp
(setq org-file-apps
      '((auto-mode . emacs)
        ("\\.mm\\'" . default)
        ("\\.x?html?\\'" . default)
        ("\\.pdf\\'" . default)
        ("\\.jpg\\'" . default)
        ("\\.png\\'" . default)
        ("\\.svg\\'" . default)
        ("\\.pptx\\'" . default)
        ("\\.tar.xz\\'" . default) ;; for org-mode extensions
        ;; Libreoffice (ODF) extensions
        ("\\.odt\\'" . default) ;; text
        ("\\.ods\\'" . default) ;; spreadsheet
        ("\\.odp\\'" . default) ;; presentation
        ("\\.odg\\'" . default) ;; graphics
        )
      )
#+end_src
- https://stackoverflow.com/questions/3973896/emacs-org-mode-file-viewer-associations
- https://emacs.stackexchange.com/questions/2856/how-to-configure-org-mode-to-respect-system-specific-default-applications-for-ex

** ~org-clock~
:PROPERTIES:
:ID:       21d12421-59e2-484c-ace5-95dfc13b67dd
:END:
Persistent org clock.

#+begin_src elisp
(setq org-clock-persist 'history)
(setq org-clock-persist-file "~/.doom.d/.org-clock-save.el")
(setq org-clock-persistence-insinuate t)
(setq org-clock-auto-clock-resolution nil)
#+end_src

Also check this at:
- https://github.com/pokeefe/Settings/blob/master/emacs-settings/.emacs.d/modules/init-org.el
  - (setq org-clock-persist-file (concat user-emacs-directory "persistence/org-clock-save.el"))

https://orgmode.org/manual/Clocking-Work-Time.html

** ~org-export-exclude-tags~
:PROPERTIES:
:ID:       54b7e29a-55da-4baf-b0a5-10848d35130e
:CREATED:  [2021-05-30 Sun 11:20]
:END:


#+begin_src elisp
(setq org-export-exclude-tags '("noexport"))
#+end_src

That way you don't have to put
#+begin_example elisp
#+EXCLUDE_TAGS: noexport
#+end_example
in every file's initial properties.

Very useful combined with a first heading containing a table of contents.

#+begin_example elisp
# * Table of Contents :TOC_4:noexport:
#+end_example

That table of contents combined with start [[id:964fd048-37ad-4bff-a09e-dbf48ab72124][unfolded]], the first thing
you see when opening a buffer will be a local and always updated table
of contents that also [[https://orgmode.org/manual/Export-Settings.html][won't be exported]]
(Check the =EXCLUDE_TAGS= section)
so it doesn't conflict with other
exports like html, latex or markup.

Neat thing indeed.

** disable "crypt" tag inheritance
:PROPERTIES:
:ID:       68153510-2ca9-4d16-ae50-6e916da8142d
:END:
- https://orgmode.org/manual/Org-Crypt.html

#+begin_src elisp
(setq org-tags-exclude-from-inheritance '("crypt"))
#+end_src

** ~org-transclusion~
:PROPERTIES:
:ID:       0d747be6-fc5d-4270-bf63-123fd81cd6c2
:CREATED:  [2021-06-02 Wed]
:END:
- Useful for Doom Emacs users.

In your ~~/.doom.d/package.el~ add the following
#+begin_example elisp
(package! org-transclusion
  :recipe (:host github
           :repo "nobiot/org-transclusion"
           :branch "main"
           :files ("*.el")))
#+end_example

And in your ~~/.doom.d/config.el~ file add
#+begin_src elisp
(use-package! org-transclusion)
#+end_src

Notice
- In your ~package.el~ file the statement starts with ~package!~ while
  in the ~config.el~ it starts with ~use-package!~.
- In your ~config.el~ file
  #+begin_example elisp
  (use-package! org-transclusion)
  #+end_example
  has to be placed _inside_ the ~(after! org)~ section like this:
  #+begin_example elisp
  (after! org
  your org config...
  (use-package! org-transclusion)
  )
  #+end_example
  - Don't have source but I remember reading it in the Doom Emacs's manual.


Details here:
- https://github.com/nobiot/org-transclusion/issues/28
- https://github.com/nobiot/org-transclusion/issues/79
- https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org
  - See the section about configuring packages.

- Examples:
  + See my ~~/.doom.d/config.org~ and ~~/.doom.d/packages.org~ files and
    search for =transclusion=. You can find them in my dotfiles.
    - https://github.com/Ma-Nu-El/home/tree/master/.doom.d


The core point of transclusion is probably not the
syncronization of info across files, but the live sync
and the saved space in storage. For static sync you
could use the #+INCLUDE keyword. In fact I use it for
university stuff. Check ~/org/uni/docs/index.html

** ~org-depend~

#+begin_src elisp
(require 'org-depend)
#+end_src

** ~org-roam~
:PROPERTIES:
  :ID:       41e53852-03b8-4098-a190-287a30504cfc
  :END:
#+begin_src elisp
;; ORG-ROAM
(setq org-roam-directory "~/auxRoam")
#+end_src
(setq org-roam-directory "~/auxRoam")
(require 'org-roam-protocol)
;; (add-hook 'after-init-hook 'org-roam-mode)
- No longer required in org-roam-v2
  - https://github.com/magit/magit/issues/3741
- [2022-10-03 Mon 21:49]
- Disabled all =org-roam= functionality as
  I updated to =roam= version 2 and some things
  broke and don't have time to fix them.

** ~org-roam-bibtex~
:PROPERTIES:
:CREATED:  [2022-10-06 Thu 22:11]
:END:

,#+begin_src elisp
;; (use-package! org-roam-bibtex
;;   :after org-roam
;;   :config
;;   (require 'org-ref))
,#+end_src

** ~org-capture~
:PROPERTIES:
:CREATED:  [2023-02-19 Sun 23:52]
:END:
- [[https://orgmode.org/manual/Capture.html][Capture (The Org Manual)]]
- [[https://howardism.org/Technical/Emacs/capturing-intro.html][Org Capturing Introduction]]
- [[https://takeonrules.com/2022/09/06/org-mode-capture-templates-and-time-tracking/][Org Mode Capture Templates and Time Tracking // Take on Rules]]
- [[https://www.reddit.com/r/emacs/comments/7zqc7b/share_your_org_capture_templates/][Share your Org Capture Templates! : emacs]]


#+begin_src elisp
(setq org-default-notes-file (concat org-directory "default_notes.org"))
#+end_src

: (setq org-capture-templates
:       '(("t" "Task Entry" entry
:          (file org-default-inbox-file)
:          "* %?\n:PROPERTIES:\n:CREATED:%U\n:END:\n%i\n"
:          :kill-buffer t)
:        ))


- [[https://orgmode.org/manual/Template-expansion.html][Template expansion (The Org Manual)]]


- [2024-04-10 Wed] This one inserts timestamps


#+begin_src elisp :tangle no
(setq org-capture-templates
     '(
      ("w" "Work" entry (file "~/FilenSync/org/refile.org")
         "* %u %?\n# - %U\n\n" :clock-in nil)
      ("W" "Work Citation" entry (file "~/FilenSync/org/bibliography.org")
         "* %u\n# - %U\n\n#+begin_src latex\n%?\n#+end_src" :clock-in nil)
      ("p" "Personal" entry (file "~/auxRoam/refile.org")
         "* %u %?\n# - %U\n\n" :clock-in nil)
      ("P" "Personal Citation" entry (file "~/auxRoam/bibliography.org")
         "* %u\n# - %U\n\n#+begin_src latex\n%?\n#+end_src" :clock-in nil)
))
#+end_src


- [2024-04-10 Wed] Now, since using
  =org-set-created-property= custom function
  ([[https://emacs.stackexchange.com/questions/21291/add-created-timestamp-to-logbook][org mode - Add "created" timestamp to LOGBOOK - Emacs Stack Exchange]]),
  I'm disabling the inactive timestamp in the
  line below heading.

#+begin_src elisp
(setq org-capture-templates
     '(
      ("w" "Work" entry (file "~/FilenSync/org/refile.org")
         "* %u %?\n\n" :clock-in nil)
      ("W" "Work Citation" entry (file "~/FilenSync/org/bibliography.org")
         "* %u %?\n\n#+begin_src latex\n%?\n#+end_src" :clock-in nil)
      ("p" "Personal" entry (file "~/auxRoam/refile.org")
         "* %u %?\n\n" :clock-in nil)
      ("P" "Personal Citation" entry (file "~/auxRoam/bibliography.org")
         "* %u %?\n\n#+begin_src latex\n%?\n#+end_src" :clock-in nil)
))
#+end_src

Use with beorg:

#+begin_quote
I use Beorg on mobile to capture stuff on my phone. And for funsies I set up my dumb Alexa speaker, and also Siri, to take TODOs and notes and save them to a "RobotTODOS.txt" file in Dropbox.
#+end_quote

** ~org-ref~
:PROPERTIES:
:CREATED:  [2023-02-24 Fri 01:01]
:END:
# - [2023-04-27 Thu 16:55]
# - Using org-glossary and org-cite


#+begin_example elisp
(use-package! org-ref
    :after org
    :commands
    (org-ref-cite-hydra/body
     org-ref-bibtex-hydra/body)
    :init
    ; code to run before loading org-ref
    :config
    (require 'org-ref)
    (add-hook 'org-export-before-parsing-hook 'org-ref-acronyms-before-parsing 'org-ref-glossary-before-parsing)
)
#+end_example

** ~org-glossary~
:PROPERTIES:
:CREATED:  [2023-04-27 Thu 23:36]
:END:
- [[https://github.com/tecosaur/org-glossary][GitHub - tecosaur/org-glossary: Glossary, Acronyms, and Index capability within Org]]


# #+begin_src emacs-lisp
(use-package! org-glossary
  :hook (org-mode . org-glossary-mode))
# #+end_src

** ~org-cite~
:PROPERTIES:
:CREATED:  [2023-05-03 Wed 12:35]
:END:

- As in [cite:@ref_20230503125135]


I want to use either:

#+begin_example emacs-lisp
(setq org-cite-global-bibliography (concat org-directory "bibliography.bib"))
#+end_example

#+RESULTS:
: ~/FilenSync/org/bibliography.bib

or

#+begin_example emacs-lisp
(setq org-cite-global-bibliography (concat (file-name-as-directory org-directory) "bibliography.bib"))
#+end_example

#+RESULTS:
: ~/FilenSync/org/bibliography.bib

but the one that works is
#+begin_example elisp
(setq org-cite-global-bibliography '("~/FilenSync/org/bibliography.bib"))
#+end_example

#+RESULTS:
: (~/FilenSync/org/bibliography.bib)

Notice that the one that works outputs
: ("~/FilenSync/org/bibliography.bib")
where as the others output
: "~/FilenSync/org/bibliography.bib"

** underscore and hat handling
:PROPERTIES:
:CREATED:  [2023-06-23 Fri 16:52]
:END:

#+begin_src elisp
(setq org-export-with-sub-superscripts nil)
#+end_src

- [[https://www.gnu.org/software/emacs/manual/html_node/org/Subscripts-and-Superscripts.html][Subscripts and Superscripts (The Org Manual)]]

** ~org-tag-alist~
:PROPERTIES:
:CREATED:  [2024-01-26 Fri 12:43]
:END:

#+begin_src elisp
(setq org-tag-alist '(
                      ("noexport" . ?n)
                      ("PROJ" . ?p)
                      ("read_only" . ?R)
                      )
)
#+end_src

** =CREATED= property
:PROPERTIES:
:CREATED:  [2024-04-10 Wed 12:12]
:END:

- [[https://emacs.stackexchange.com/questions/21291/add-created-timestamp-to-logbook][org mode - Add "created" timestamp to LOGBOOK - Emacs Stack Exchange]]


#+begin_src elisp
(defvar org-created-property-name "CREATED"
  "The name of the org-mode property that stores the creation date of the entry")

(defun org-set-created-property (&optional active NAME)
  "Set a property on the entry giving the creation time.

By default the property is called CREATED. If given the `NAME'
argument will be used instead. If the property already exists, it
will not be modified."
  (interactive)
  (let* ((created (or NAME org-created-property-name))
         (fmt (if active "<%s>" "[%s]"))
         (now  (format fmt (format-time-string "%Y-%m-%d %a %H:%M"))))
    (unless (org-entry-get (point) created nil)
      (org-set-property created now))))
(add-hook 'org-capture-before-finalize-hook #'org-set-created-property)
#+end_src

** ~org-priority-[highest|default|lowest]~
:PROPERTIES:
:CREATED:  [2024-09-03 Tue 17:23]
:END:

Priority can't be more than one character; i.e.: ~10~
is two characters long where as ~9~ is one only.
Therefore, lowest is ~9~ instead of ~10~. If you want a
larger range you can use it with alphabetical
characters but that would be even more confusing for me
at least.

#+begin_src elisp
(setq org-enable-priority-commands t
    org-priority-highest 1
    org-priority-default 9
    org-priority-lowest 9)
#+end_src

