.doom.d/config.el

(setq org-file-apps
      '((auto-mode . emacs)
        ("\\.mm\\'" . default)
        ("\\.x?html?\\'" . default)
        ("\\.pdf\\'" . default)
        ("\\.jpg\\'" . default)
        ("\\.png\\'" . default)
        ("\\.svg\\'" . default)
        ("\\.pptx\\'" . default)
        ("\\.tar.xz\\'" . default) ;; for org-mode extensions
        ;; Libreoffice (ODF) extensions
        ("\\.odt\\'" . default) ;; text
        ("\\.ods\\'" . default) ;; spreadsheet
        ("\\.odp\\'" . default) ;; presentation
        ("\\.odg\\'" . default) ;; graphics
        )
      )

(setq org-clock-persist 'history)
(setq org-clock-persist-file "~/.doom.d/.org-clock-save.el")
(setq org-clock-persistence-insinuate t)
(setq org-clock-auto-clock-resolution nil)

(setq org-export-exclude-tags '("noexport"))

(setq org-tags-exclude-from-inheritance '("crypt"))

(use-package! org-transclusion)

(require 'org-depend)

;; ORG-ROAM
(setq org-roam-directory "~/auxRoam")

(setq org-default-notes-file (concat org-directory "default_notes.org"))

(setq org-capture-templates
     '(
      ("w" "Work" entry (file "~/FilenSync/org/refile.org")
         "* %u %?\n\n" :clock-in nil)
      ("W" "Work Citation" entry (file "~/FilenSync/org/bibliography.org")
         "* %u %?\n\n#+begin_src latex\n%?\n#+end_src" :clock-in nil)
      ("p" "Personal" entry (file "~/auxRoam/refile.org")
         "* %u %?\n\n" :clock-in nil)
      ("P" "Personal Citation" entry (file "~/auxRoam/bibliography.org")
         "* %u %?\n\n#+begin_src latex\n%?\n#+end_src" :clock-in nil)
))

(setq org-export-with-sub-superscripts nil)

(setq org-tag-alist '(
                      ("noexport" . ?n)
                      ("PROJ" . ?p)
                      ("read_only" . ?R)
                      )
)

(defvar org-created-property-name "CREATED"
  "The name of the org-mode property that stores the creation date of the entry")

(defun org-set-created-property (&optional active NAME)
  "Set a property on the entry giving the creation time.

By default the property is called CREATED. If given the `NAME'
argument will be used instead. If the property already exists, it
will not be modified."
  (interactive)
  (let* ((created (or NAME org-created-property-name))
         (fmt (if active "<%s>" "[%s]"))
         (now  (format fmt (format-time-string "%Y-%m-%d %a %H:%M"))))
    (unless (org-entry-get (point) created nil)
      (org-set-property created now))))
(add-hook 'org-capture-before-finalize-hook #'org-set-created-property)

(setq org-enable-priority-commands t
    org-priority-highest 1
    org-priority-default 9
    org-priority-lowest 9)
