.doom.d/config.org
** ~my/org-archive-done-tasks~
:PROPERTIES:
:CREATED:  [2024-09-21 Sat 16:06]
:END:

#+begin_src elisp
(defun my/org-get-parent-heading ()
  "Return the name of the parent heading of the current task."
  (save-excursion
    (outline-up-heading 1 t)  ;; Move to the parent heading
    (org-get-heading t t t t)))  ;; Get the parent heading name without tags or properties

(defun my/org-dynamic-archive-location ()
  "Dynamically generate the archive location based on the parent heading and current year.
The heading is sanitized to remove brackets, tags, and other non-alphabetic characters."
  (let* ((year (format-time-string "%Y"))  ;; Get the current year
         (parent-heading (my/org-get-parent-heading))  ;; Get the parent heading
         ;; Remove bracketed content (like [1/2][50%]) and tags (like :personal:)
         (clean-heading (replace-regexp-in-string "\\[.*?\\]\\|:[^:]*:" "" parent-heading))
         ;; Sanitize the heading: strip extra spaces and convert to lowercase with underscores
         (sanitized-heading (replace-regexp-in-string " +" "_" (downcase (string-trim clean-heading))))
         ;; Construct the archive file path
         (archive-file (concat "calendar/" year "/" sanitized-heading "_gtd_archive.org")))
    archive-file))  ;; Return the archive file path

(defun my/org-archive-done-tasks ()
  "Archive DONE tasks using a dynamically generated archive location based on the parent heading and year.
The default archive behavior is restored after the custom archiving."
  (interactive)
  (let ((org-archive-location (concat (my/org-dynamic-archive-location) "::")))  ;; Temporarily set archive location
    (org-archive-subtree)))  ;; Archive the current subtree
#+end_src

** ~my/org-agenda-custom-search-next-action~ and ~my/org-convert-to-next-action~
:PROPERTIES:
:CREATED:  [2024-09-23 Mon 13:16]
:END:

*** helper function

#+begin_src elisp
(defun create-prompt-from-list (prompt lst)
  "Helper function for numbered options with dots for alignment."
  (let ((max-length (apply 'max (mapcar 'length lst)))  ;; Get the max length of the items
        (choices ""))
    (cl-loop for x in lst
             for idx from 1
             do (let ((dots (make-string (- (+ max-length 5) (length x)) ?.)))  ;; Create the dots
                  (setq choices (concat choices (format "%s %s (%d)\n" x dots idx)))))
    (let ((choice (read-string (concat prompt "\n" choices "\nPress Enter to skip: "))))
      (if (and (string-match "^[0-9]+$" choice)  ;; Only accept numeric input
               (<= (string-to-number choice) (length lst)))
          (nth (1- (string-to-number choice)) lst)  ;; Return the selected tag
        nil))))  ;; Return nil if input is empty or invalid
#+end_src

*** ~my/org-agenda-custom-search-next-action~

#+begin_src elisp
;; Helper function to convert effort to HH:MM format
(defun effort-to-hhmm (effort-string)
  "Convert an EFFORT string in MINUTES or HOUR:MINUTE format to 'HH:MM'."
  (if (string-match-p ":" effort-string)
      ;; If format is HOUR:MINUTE (contains ":")
      effort-string
    ;; If format is just MINUTE, convert to HOUR:MINUTE
    (let* ((minutes (string-to-number effort-string))
           (hours (/ minutes 60))
           (mins (% minutes 60)))
      (format "%d:%02d" hours mins))))

;; Main function
(defun my/org-agenda-custom-search-next-action ()
  "Search Org mode agenda for entries with TODO='NEXT', CONTEXT, PLACE, ENERGY, EFFORT range, and optionally filter by PROJ ancestors.
If any argument is empty, the filter is ignored."
  (interactive)
  (let* (
         ;; CONTEXT filter selection (using `my-custom-tags-personal` from personal.el)
         (context-choice
          (create-prompt-from-list "Context (optional):" my-custom-tags-personal))

         ;; PLACE filter selection (using `my-custom-tags-place` from personal.el)
         (place-choice
          (create-prompt-from-list "Place (optional):" my-custom-tags-place))

         ;; ENERGY filter selection (using `my-custom-tags-energy` from personal.el)
         (energy-choice
          (create-prompt-from-list "Energy (optional):" my-custom-tags-energy))

         ;; Minimum EFFORT
         (min-effort (read-string "Minimum EFFORT (HOUR:MINUTE or MINUTE, leave empty to ignore): " nil nil ""))

         ;; Maximum EFFORT
         (max-effort (read-string "Maximum EFFORT (HOUR:MINUTE or MINUTE, leave empty to ignore): " nil nil ""))

         ;; PROJ filter selection (y/n or skip)
         (proj-only
          (let ((choice (read-string "Show only tasks with PROJ ancestors (y) or only without PROJ ancestors (n)? (Press Enter to skip): ")))
            (cond
             ((string= choice "y") t)   ;; If 'y', return true for project-related tasks
             ((string= choice "n") nil) ;; If 'n', return false for non-project tasks
             (t 'skip)))))  ;; If Enter is pressed, skip the PROJ filter entirely

    ;; Build the query, starting with TODO="NEXT"
    (let (query)
      (setq query "TODO=\"NEXT\"")

      ;; Add CONTEXT filter
      (when context-choice
        (setq query (concat query (format "+%s" context-choice))))

      ;; Add PLACE filter
      (when place-choice
        (setq query (concat query (format "+%s" place-choice))))

      ;; Add ENERGY filter
      (when energy-choice
        (setq query (concat query (format "+%s" energy-choice))))

      ;; Add Minimum EFFORT filter
      (when (and min-effort (not (string= min-effort "")))
        (setq query (concat query (format "+EFFORT>=\"%s\"" (effort-to-hhmm min-effort)))))

      ;; Add Maximum EFFORT filter
      (when (and max-effort (not (string= max-effort "")))
        (setq query (concat query (format "+EFFORT<=\"%s\"" (effort-to-hhmm max-effort)))))

      ;; Handle PROJ filtering (t, nil, or skip)
      (cond
       ((eq proj-only t)
        (setq query (concat query "+PROJ")))  ;; Show only project tasks
       ((eq proj-only nil)
        (setq query (concat query "-PROJ")))) ;; Exclude project tasks

      ;; Perform the search with the constructed query
      (org-tags-view nil query))))
#+end_src

*** ~my/org-convert-to-next-action~

#+begin_src elisp
(defun my/org-convert-to-next-action ()
  "Convert a TODO heading to a NEXT action, adding CONTEXT, PLACE, and ENERGY properties.
Calls `org-set-effort' to assign EFFORT interactively afterward.
Works if the point is anywhere within the subtree of the heading."
  (interactive)
  (save-excursion
    ;; Move point to the nearest heading, regardless of where it is in the subtree
    (org-back-to-heading t)

    (let* (
           ;; CONTEXT prompt with dots
           (context-choice
            (create-prompt-from-list "Context (optional):" my-custom-tags-personal))

           ;; PLACE prompt with dots
           (place-choice
            (create-prompt-from-list "Place (optional):" my-custom-tags-place))

           ;; ENERGY prompt with dots
           (energy-choice
            (create-prompt-from-list "Energy (optional):" my-custom-tags-energy)))

      ;; Replace the TODO keyword with NEXT
      (org-todo "NEXT")

      ;; Build the tags string from the choices and add it to the heading
      (let ((tags (concat (or context-choice "")
                          (if (and context-choice place-choice) ":" "")
                          (or place-choice "")
                          (if (and (or context-choice place-choice) energy-choice) ":" "")
                          (or energy-choice ""))))
        (org-set-tags-to tags))

      ;; Call org-set-effort for the interactive effort input
      (org-set-effort nil))))
#+end_src

** load tags file
:PROPERTIES:
:CREATED:  [2024-09-23 Mon 12:05]
:END:

#+begin_src emacs-lisp
;; Load personal settings from ~/.doom.d/personal.el, if it exists
(when (file-exists-p "~/.doom.d/personal.el")
  (load "~/.doom.d/personal.el"))

#+end_src

** CNLD log
:LOGBOOK:
- State "CNLD"       from              [2024-09-25 Wed 18:18]
:END:

Throws error. Disabling since not essential.
##+begin_src elisp
(defun org-summary-todo (n-done n-not-done)
"Switch entry to DONE when all subentries are done, to TODO otherwise."
(let (org-log-done org-log-states)   ; turn off logging
(org-todo (if (= n-not-done 0) "DONE" "TODO")))
)
##+end_src

