.doom.d/config.org
** CNLD org fontify quote and verse blocks [DISABLED]
:PROPERTIES:
:ID:       5a04cbc3-238b-4f1c-8ec9-40b93404f25d
:END:
:LOGBOOK:
- State "CNLD"       from              [2024-09-25 Wed 18:17]
:END:
- https://emacs.stackexchange.com/questions/63344/italics-not-shown-in-block-quotes-in-orgmode

Original idea:
#+begin_quote
So that way when exporting =quote= blocks, they are fontified by default.
Since the variable ~org-fontify-quote-and-verse-block~ is set to ~nil~ by
default at time of writing ([2021-06-22 Tue]).
#+end_quote

#+begin_example
#+begin_src elisp
(setq org-fontify-quote-and-verse-blocks t)
#+end_src
#+end_example

*Commented out*: fontification only takes place inside the =orgmode= buffer,
but the exported part --- at least to =html= --- is still not executed; you
still have to put a =/= around the words you want to be /italiced/ when
exporting.

** CNLD disable heading numbering during export
:PROPERTIES:
:CREATED:  [2023-07-08 Sat 23:58]
:END:
:LOGBOOK:
- State "CNLD"       from              [2024-09-25 Wed 18:15] \\
  Not using it.
:END:
- [[https://stackoverflow.com/questions/9092445/how-do-you-remove-numbering-from-headers-when-exporting-from-org-mode][emacs - How do you remove numbering from headers when exporting from org-mode? - Stack Overflow]]


: #+begin_src elisp
: (setq org-export-with-section-numbers nil)
: #+end_src

** CNLD prevent invisible edits [Commented out]
:PROPERTIES:
:ID:       b2c447ca-344c-451a-b3a4-cbb168ecb91e
:END:
:LOGBOOK:
- State "CNLD"       from              [2024-09-25 Wed 18:16]
:END:
- https://emacs.stackexchange.com/questions/2086/org-mode-prevent-editing-of-text-within-collapsed-subtree



#+begin_quote
Documentation
Check if in invisible region before inserting or deleting a character.

Valid values are:

nil              Do not check, so just do invisible edits.
error            Throw an error and do nothing.
show             Make point visible, and do the requested edit.
show-and-error   Make point visible, then throw an error and abort the edit.
smart            Make point visible, and do insertion/deletion if it is
adjacent to visible text and the change feels predictable.
Never delete a previously invisible character or add in the
middle or right after an invisible region.  Basically, this
allows insertion and backward-delete right before ellipses.
FIXME: maybe in this case we should not even show?

This variable was added, or its default value changed, in Emacs 24.1.
#+end_quote

~#+begin_src elisp
(setq-default org-catch-invisible-edits 'error)
~#+end_src

I did not understand the =smart= option. Simply fail
and let me know so I'm more careful. It's not something
that I do a lot so low signal-to-noise ratio.

Commented out since it does not fail and does not let
me know that I did a mistake. I'll simply have to be
more careful.

* end org section
:PROPERTIES:
:ID:       889fe81d-8200-4e4f-b833-a2c20cc295eb
:END:
#+begin_src elisp
)
;; END AFTER ORG
#+end_src

* flyspell-mode t
:PROPERTIES:
:ID:       12e43ea2-162e-4a48-8115-da3fb00a32c1
:END:

# #+begin_src elisp
# (add-hook 'text-mode-hook 'flyspell-mode)
# (add-hook 'prog-mode-hook 'flyspell-prog-mode)
# #+end_src

* ispell config
:PROPERTIES:
:ID:       71aa1a7e-7cf6-4eb3-8fe5-e3d824003528
:END:

# #+begin_src elisp
# (setq ispell-dictionary "en")
# #+end_src

- Seems unnecessary.

* personal keybindings
  :PROPERTIES:
  :ID:       0cc3c478-ed08-4e4a-b993-a2ff205b829d
  :END:
#+begin_src elisp
(define-key evil-motion-state-map (kbd "C-z") nil) ; disable C-z as 'pause'
(global-set-key (kbd "\C-cr") 'ispell-region)
#+end_src

* start week on monday
  :PROPERTIES:
  :ID:       c1d944f2-b415-42b6-8e75-73a33185d38c
  :END:
- [2021-06-08 Tue 19:46]
#+begin_src elisp
(setq calendar-week-start-day 1)
#+end_src
- https://emacs.stackexchange.com/questions/42571/org-agenda-date-prompt-mini-calendar-start-week-on-monday

* dailies
:PROPERTIES:
:ID:       2078934a-a605-4347-a616-9359566f16f7
:END:
;; https://www.orgroam.com/manual.html#Daily_002dnotes
##+begin_src elisp
(setq org-roam-dailies-directory "~/org/dailies/")
(setq org-roam-dailies-capture-templates
'(("d" "default" entry
#'org-roam-capture--get-point
"* %?"
:file-name "daily/%<%Y-%m-%d>"
:head "#+title: %<%Y-%m-%d>\n\n"))
)
##+end_src

* treemacs
:PROPERTIES:
:ID:       c7dc78b9-6e98-4b63-8343-8ee68efce605
:END:

#+begin_src elisp
(setq +treemacs-git-mode 'simple)
#+end_src

* disable backup
:PROPERTIES:
:ID:       9a8a2efc-9871-4f88-9231-8017e44186e5
:END:
#+begin_src elisp
;; disable backup
(setq backup-inhibited t)
;; disable auto save
(setq auto-save-default nil)
#+end_src

* custom set faces
:PROPERTIES:
:ID:       5b57bd2a-7746-41c9-ab96-dd1a9d0147ef
:END:

#+begin_src elisp
(custom-set-faces!
  '(aw-leading-char-face
    :foreground "white" :background "red"
    :weight bold :height 2.5 :box (:line-width 10 :color "red")))
#+end_src

* custom set variables
:PROPERTIES:
:ID:       b9de5245-3299-4e27-8956-9c4668ee337b
:END:

#+begin_src elisp
;; (custom-set-variables
;;  '(safe-local-variable-values (quote ((ispell-dictionary . "español"))))
;;  )
#+end_src

* 60 char ruler :line:width:80char:terminal:ATTACH:
:PROPERTIES:
:ID:       afa21908-f444-43d4-a5fb-19b770cf13ec
:END:
- [2021-07-10 Sat 16:10]
- Since last =doom upgrade= a couple minutes ago, the ruler
  at 80 characters was gone. Also the =fill-column= module
  in =init.el=, specifically the =:ui= section was also gone.
- I got it back with this elisp but now also that ruler appears
  in the home view for Doom which is something new lol.
  Anyway, gets the job done but takes elegancy of Doom a
  little down. Still invaluable tool tho.
- https://stackoverflow.com/questions/578059/studies-on-optimal-code-width
- https://www.reddit.com/r/emacs/comments/kab809/for_those_who_dont_already_know_emacs_supports/
- https://www.reddit.com/r/emacs/comments/hezzwb/fillcolumnindicator_issue/
- https://www.reddit.com/r/emacs/comments/k895t5/displayfillcolumnindicatorcolumn_not_applying_on/


#+begin_src elisp
;; Load environment variables from the shell
;; (exec-path-from-shell-initialize)

;; Access the custom line length from the environment variable
(let ((line-length (string-to-number (or (getenv "CUSTOM_CLI_LINE_LENGTH") "55"))))
  ;;(setq display-fill-column-indicator t)
  (setq-default display-fill-column-indicator-column line-length)
  (setq-default fill-column line-length)
  (global-display-fill-column-indicator-mode))
#+end_src

- [2021-11-27 Sat 17:07] 65
- New update to '65' was actually not easy lol.
- [2021-11-27 Sat 22:52] 56
  - Because of the terminal zoom mechanism
  - Useful for two windows.
- [2021-11-28 Sun 15:19] 55
- See here
  - [[id:09354657-bb03-47ee-a5b2-ba91f2113050][Line width: 37 characters]]
- [2021-11-28 Sun 19:15]
  - [[id:668a9d2e-9ee9-47f7-a988-9fc3eac8b602][now 66]]
- [2021-11-28 Sun 19:32]
  - [[id:5ac9a42a-b152-4d31-ae69-9601c02cc0d1][now 70]]
- [2021-11-28 Sun 19:39]
  - [[id:4e935b6d-a359-4a08-9a86-7c07951ff3ef][now 60]]
- [2021-12-18 Sat 14:22]
  - now 56
  - Same as above.
- [2021-12-18 Sat 14:25]
  - 55
- [2024-04-04 Thu 18:14]
  - [[https://stackoverflow.com/questions/3566727/how-to-set-the-default-width-of-fill-mode-to-80-with-emacs][How to set the default width of fill mode to 80 with emacs? - Stack Overflow]]

* git gutter
:PROPERTIES:
:ID:       74f03acd-57b5-487d-af07-716129320bac
:END:
- [2021-11-30 Tue 20:28]
- https://github.com/hlissner/doom-emacs/issues/4369

#+begin_src elisp
(global-git-gutter-mode +1)
#+end_src

* ~org-ai~
:PROPERTIES:
:CREATED:  [2023-11-15 Wed 22:37]
:END:


#+begin_src elisp :tangle no
(setq org-ai-openai-api-token "")

(use-package! org-ai
  :ensure t
  :defer t
  :commands (org-ai-mode
             org-ai-global-mode);;
  :init
  (add-hook 'org-mode-hook #'org-ai-mode) ; enable org-ai in org-mode
  (org-ai-global-mode) ; installs global keybindings on C-c M-a
  :config
  (setq org-ai-default-chat-model "gpt-3.5-turbo") ; if you are on the free gpt-3.5-turbo:
  ;; (setq org-ai-default-chat-model "gpt-4") ; if you are on the gpt-4 beta:
  (org-ai-install-yasnippets)) ; if you are using yasnippet and want ai snippets
#+end_src

* fix =zo= not working in macOS
# - [2024-01-03 Wed 16:24]

#+begin_src elisp
(after! org (setq org-fold-core-style 'overlays) )
#+end_src

* orgmode readonly custom functions
:PROPERTIES:
:CREATED:  [2024-02-07 Wed 16:10]
:END:

#+begin_src elisp
(defun org-mark-readonly ()
  (interactive)
  (org-map-entries
   (lambda ()
     (let* ((element (org-element-at-point))
            (begin (org-element-property :begin element))
            (end (org-element-property :end element)))
       (add-text-properties begin (- end 1) '(read-only t))))
   "read_only")
)

(defun org-remove-readonly ()
  (interactive)
  (org-map-entries
   (lambda ()
     (let* ((element (org-element-at-point))
            (begin (org-element-property :begin element))
            (end (org-element-property :end element))
            (inhibit-read-only t))
         (remove-text-properties begin (- end 1) '(read-only t))))
     "read_only")
     (message "readonly disabled")
  )

(add-hook 'org-mode-hook 'org-mark-readonly)

#+end_src

* keyboard shortcuts
:PROPERTIES:
:CREATED:  [2023-09-07 Thu 16:31]
:END:
- [[https://www.dschapman.com/notes/bde6e938-0984-4d60-974d-77178f1ecd9b][How to Add Shortcuts to Doom Emacs]]
- [[https://rameezkhan.me/posts/2020/2020-07-03--adding-keybindings-to-doom-emacs/][Adding keybindings to Doom Emacs | rameezkhan.me]]


# - [2023-11-26 Sun 14:20]
- [[https://orgmode.org/manual/Column-Width-and-Alignment.html][Column Width and Alignment (The Org Manual)]]


#+begin_src elisp
(map! :leader
  (:prefix-map ("k" . "custom key bindings")

    (:prefix-map ("r" . "reload")
     :desc "Current dynamic block" "d" #'org-update-dblock
     :desc "All dynamic blocks" "D" #'org-update-all-dblocks
    )

    (:prefix-map ("a" . "align")
     :desc "align-regexp" "r" #'align-regexp
    )

    (:prefix-map ("c" . "code")
     :desc "org-edit-src-block" "c" #'org-edit-src-code
    )

    (:prefix-map ("o" . "orgmode")
      (:prefix-map ("p" . "Add property")
       :desc "CREATED" "c" #'org-set-created-property
      )

      (:prefix-map ("k" . "org-kanban")
       :desc "Insert kanban here" "i" #'org-kanban/initialize-here
       :desc "Configure kanban block at point" "c" #'org-kanban/configure-block
       :desc "Shift TODO state of current entry" "s" #'org-kanban/shift
      )

      (:prefix-map ("T" . "table")
         :desc "org-table-shrink" "s" #'org-table-shrink
         :desc "org-table-expand" "e" #'org-table-expand
         :desc "org-table-toggle-column-width" "t" #'org-table-toggle-column-width
      )

      (:prefix-map ("t" . "TODO")
         :desc "my/org-convert-to-next-action" "n" #'my/org-convert-to-next-action
      )

      (:prefix-map ("r" . "readonly")
         :desc "org-mark-readonly" "e" #'org-mark-readonly
         :desc "org-remove-readonly" "d" #'org-remove-readonly
      )
      :desc "my/org-archive-done-tasks" "A" #'my/org-archive-done-tasks
      (:prefix-map ("a" . "agenda")
         :desc "my/org-agenda-custom-search-next-action" "n" #'my/org-agenda-custom-search-next-action
      )
    )
  )
)
#+end_src

- [2023-11-24 Fri 17:09]
- [[https://github.com/doomemacs/doomemacs/blob/master/modules/lang/data/config.el][doomemacs/modules/lang/data/config.el at master · doomemacs/doomemacs · GitHub]]
- [[https://emacs.stackexchange.com/questions/71553/in-huge-csv-files-how-can-i-easily-find-out-in-which-csv-column-the-cursor-is][minor mode - In huge CSV files how can I easily find out in which CSV column the cursor is? - Emacs Stack Exchange]]


#+begin_src elisp
;;;###package csv-mode
(map! :after csv-mode
      :localleader
      :map csv-mode-map
      "a" #'csv-align-fields
      "u" #'csv-unalign-fields
      "s" #'csv-sort-fields
      "S" #'csv-sort-numeric-fields
      "k" #'csv-kill-fields
      "t" #'csv-transpose
      "h" #'csv-header-line
      )
#+end_src
