.doom.d/config.el

(define-key evil-motion-state-map (kbd "C-z") nil) ; disable C-z as 'pause'
(global-set-key (kbd "\C-cr") 'ispell-region)

(setq calendar-week-start-day 1)

(setq +treemacs-git-mode 'simple)

;; disable backup
(setq backup-inhibited t)
;; disable auto save
(setq auto-save-default nil)

(custom-set-faces!
  '(aw-leading-char-face
    :foreground "white" :background "red"
    :weight bold :height 2.5 :box (:line-width 10 :color "red")))

;; (custom-set-variables
;;  '(safe-local-variable-values (quote ((ispell-dictionary . "español"))))
;;  )

;; Load environment variables from the shell
;; (exec-path-from-shell-initialize)

;; Access the custom line length from the environment variable
(let ((line-length (string-to-number (or (getenv "CUSTOM_CLI_LINE_LENGTH") "55"))))
  ;;(setq display-fill-column-indicator t)
  (setq-default display-fill-column-indicator-column line-length)
  (setq-default fill-column line-length)
  (global-display-fill-column-indicator-mode))

(global-git-gutter-mode +1)

(after! org (setq org-fold-core-style 'overlays) )

(defun org-mark-readonly ()
  (interactive)
  (org-map-entries
   (lambda ()
     (let* ((element (org-element-at-point))
            (begin (org-element-property :begin element))
            (end (org-element-property :end element)))
       (add-text-properties begin (- end 1) '(read-only t))))
   "read_only")
)

(defun org-remove-readonly ()
  (interactive)
  (org-map-entries
   (lambda ()
     (let* ((element (org-element-at-point))
            (begin (org-element-property :begin element))
            (end (org-element-property :end element))
            (inhibit-read-only t))
         (remove-text-properties begin (- end 1) '(read-only t))))
     "read_only")
     (message "readonly disabled")
  )

(add-hook 'org-mode-hook 'org-mark-readonly)

(map! :leader
  (:prefix-map ("k" . "custom key bindings")

    (:prefix-map ("r" . "reload")
     :desc "Current dynamic block" "d" #'org-update-dblock
     :desc "All dynamic blocks" "D" #'org-update-all-dblocks
    )

    (:prefix-map ("a" . "align")
     :desc "align-regexp" "r" #'align-regexp
    )

    (:prefix-map ("c" . "code")
     :desc "org-edit-src-block" "c" #'org-edit-src-code
    )

    (:prefix-map ("o" . "orgmode")
      (:prefix-map ("p" . "Add property")
       :desc "CREATED" "c" #'org-set-created-property
      )

      (:prefix-map ("k" . "org-kanban")
       :desc "Insert kanban here" "i" #'org-kanban/initialize-here
       :desc "Configure kanban block at point" "c" #'org-kanban/configure-block
       :desc "Shift TODO state of current entry" "s" #'org-kanban/shift
      )

      (:prefix-map ("T" . "table")
         :desc "org-table-shrink" "s" #'org-table-shrink
         :desc "org-table-expand" "e" #'org-table-expand
         :desc "org-table-toggle-column-width" "t" #'org-table-toggle-column-width
      )

      (:prefix-map ("t" . "TODO")
         :desc "my/org-convert-to-next-action" "n" #'my/org-convert-to-next-action
      )

      (:prefix-map ("r" . "readonly")
         :desc "org-mark-readonly" "e" #'org-mark-readonly
         :desc "org-remove-readonly" "d" #'org-remove-readonly
      )
      :desc "my/org-archive-done-tasks" "A" #'my/org-archive-done-tasks
      (:prefix-map ("a" . "agenda")
         :desc "my/org-agenda-custom-search-next-action" "n" #'my/org-agenda-custom-search-next-action
      )
    )
  )
)

;;;###package csv-mode
(map! :after csv-mode
      :localleader
      :map csv-mode-map
      "a" #'csv-align-fields
      "u" #'csv-unalign-fields
      "s" #'csv-sort-fields
      "S" #'csv-sort-numeric-fields
      "k" #'csv-kill-fields
      "t" #'csv-transpose
      "h" #'csv-header-line
      )
